data/raw_bench/1900_output.txt
Running 30s test @ http://10.99.59.146:8080/wrk2-api/home-timeline/read
  4 threads and 200 connections

  Thread calibration: mean lat.: 0.533ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.533ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.530ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.537ms, rate sampling interval: 10ms

-----------------------------------------------------------------------
Test Results @ http://10.99.59.146:8080/wrk2-api/home-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   526.35us  101.63us 831.00us   74.40%
    Req/Sec   499.89    228.90     1.11k    70.48%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  509.00us
 75.000%  579.00us
 90.000%  653.00us
 99.000%  831.00us
 99.900%    1.17ms
 99.990%    1.83ms
 99.999%    2.00ms
100.000%    2.00ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.282     0.000000            1         1.00
       0.418     0.100000         3869         1.11
       0.446     0.200000         7709         1.25
       0.467     0.300000        11428         1.43
       0.488     0.400000        15261         1.67
       0.509     0.500000        18974         2.00
       0.521     0.550000        20857         2.22
       0.534     0.600000        22761         2.50
       0.548     0.650000        24718         2.86
       0.563     0.700000        26584         3.33
       0.579     0.750000        28432         4.00
       0.589     0.775000        29401         4.44
       0.599     0.800000        30316         5.00
       0.610     0.825000        31242         5.71
       0.622     0.850000        32191         6.67
       0.636     0.875000        33133         8.00
       0.645     0.887500        33638         8.89
       0.653     0.900000        34078        10.00
       0.663     0.912500        34543        11.43
       0.674     0.925000        35032        13.33
       0.686     0.937500        35491        16.00
       0.694     0.943750        35736        17.78
       0.702     0.950000        35989        20.00
       0.711     0.956250        36203        22.86
       0.722     0.962500        36436        26.67
       0.735     0.968750        36674        32.00
       0.743     0.971875        36800        35.56
       0.753     0.975000        36915        40.00
       0.763     0.978125        37027        45.71
       0.775     0.981250        37151        53.33
       0.788     0.984375        37266        64.00
       0.798     0.985938        37330        71.11
       0.809     0.987500        37389        80.00
       0.822     0.989062        37442        91.43
       0.842     0.990625        37503       106.67
       0.859     0.992188        37562       128.00
       0.873     0.992969        37591       142.22
       0.890     0.993750        37619       160.00
       0.906     0.994531        37648       182.86
       0.932     0.995313        37678       213.33
       0.958     0.996094        37708       256.00
       0.979     0.996484        37722       284.44
       0.991     0.996875        37738       320.00
       1.013     0.997266        37752       365.71
       1.032     0.997656        37767       426.67
       1.061     0.998047        37783       512.00
       1.080     0.998242        37789       568.89
       1.098     0.998437        37796       640.00
       1.125     0.998633        37805       731.43
       1.135     0.998828        37811       853.33
       1.177     0.999023        37819      1024.00
       1.196     0.999121        37822      1137.78
       1.218     0.999219        37826      1280.00
       1.239     0.999316        37830      1462.86
       1.246     0.999414        37833      1706.67
       1.281     0.999512        37837      2048.00
       1.317     0.999561        37839      2275.56
       1.330     0.999609        37841      2560.00
       1.372     0.999658        37843      2925.71
       1.377     0.999707        37844      3413.33
       1.482     0.999756        37846      4096.00
       1.494     0.999780        37847      4551.11
       1.519     0.999805        37848      5120.00
       1.555     0.999829        37849      5851.43
       1.802     0.999854        37850      6826.67
       1.831     0.999878        37851      8192.00
       1.831     0.999890        37851      9102.22
       1.897     0.999902        37852     10240.00
       1.897     0.999915        37852     11702.86
       1.914     0.999927        37853     13653.33
       1.914     0.999939        37853     16384.00
       1.914     0.999945        37853     18204.44
       1.969     0.999951        37854     20480.00
       1.969     0.999957        37854     23405.71
       1.969     0.999963        37854     27306.67
       1.969     0.999969        37854     32768.00
       1.969     0.999973        37854     36408.89
       2.002     0.999976        37855     40960.00
       2.002     1.000000        37855          inf
#[Mean    =        0.526, StdDeviation   =        0.102]
#[Max     =        2.002, Total count    =        37855]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  56760 requests in 30.00s, 10.77MB read
  Socket errors: connect 0, read 0, write 0, timeout 1
Requests/sec:   1891.84  
Transfer/sec:    367.65KB