data/raw_bench/2000_output.txt
Running 30s test @ http://10.99.59.146:8080/wrk2-api/home-timeline/read
  4 threads and 200 connections

  Thread calibration: mean lat.: 0.533ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.529ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.531ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.528ms, rate sampling interval: 10ms

-----------------------------------------------------------------------
Test Results @ http://10.99.59.146:8080/wrk2-api/home-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   530.50us  290.66us 847.00us   98.78%
    Req/Sec   526.51    232.93     1.11k    70.76%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  506.00us
 75.000%  574.00us
 90.000%  647.00us
 99.000%  847.00us
 99.900%    3.59ms
 99.990%   11.45ms
 99.999%   24.93ms
100.000%   24.93ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.299     0.000000            1         1.00
       0.415     0.100000         4041         1.11
       0.442     0.200000         8030         1.25
       0.464     0.300000        12088         1.43
       0.484     0.400000        16004         1.67
       0.506     0.500000        20037         2.00
       0.517     0.550000        21984         2.22
       0.530     0.600000        24055         2.50
       0.543     0.650000        26012         2.86
       0.558     0.700000        27983         3.33
       0.574     0.750000        29985         4.00
       0.583     0.775000        30922         4.44
       0.594     0.800000        31996         5.00
       0.605     0.825000        32989         5.71
       0.616     0.850000        33913         6.67
       0.630     0.875000        34914         8.00
       0.638     0.887500        35409         8.89
       0.647     0.900000        35926        10.00
       0.656     0.912500        36400        11.43
       0.668     0.925000        36924        13.33
       0.682     0.937500        37423        16.00
       0.689     0.943750        37649        17.78
       0.699     0.950000        37910        20.00
       0.710     0.956250        38154        22.86
       0.722     0.962500        38420        26.67
       0.735     0.968750        38669        32.00
       0.743     0.971875        38774        35.56
       0.753     0.975000        38894        40.00
       0.765     0.978125        39026        45.71
       0.780     0.981250        39153        53.33
       0.798     0.984375        39268        64.00
       0.808     0.985938        39331        71.11
       0.819     0.987500        39392        80.00
       0.837     0.989062        39458        91.43
       0.856     0.990625        39517       106.67
       0.889     0.992188        39582       128.00
       0.907     0.992969        39611       142.22
       0.934     0.993750        39641       160.00
       0.972     0.994531        39673       182.86
       1.006     0.995313        39705       213.33
       1.051     0.996094        39735       256.00
       1.082     0.996484        39750       284.44
       1.116     0.996875        39766       320.00
       1.143     0.997266        39781       365.71
       1.189     0.997656        39797       426.67
       1.269     0.998047        39813       512.00
       1.310     0.998242        39820       568.89
       1.576     0.998437        39828       640.00
       1.998     0.998633        39836       731.43
       2.843     0.998828        39844       853.33
       3.683     0.999023        39852      1024.00
       4.535     0.999121        39855      1137.78
       4.707     0.999219        39859      1280.00
       5.455     0.999316        39863      1462.86
       6.079     0.999414        39867      1706.67
       6.995     0.999512        39871      2048.00
       7.355     0.999561        39873      2275.56
       7.547     0.999609        39875      2560.00
       7.887     0.999658        39877      2925.71
       8.607     0.999707        39879      3413.33
       9.591     0.999756        39881      4096.00
      10.303     0.999780        39882      4551.11
      10.343     0.999805        39883      5120.00
      10.383     0.999829        39884      5851.43
      10.743     0.999854        39885      6826.67
      11.447     0.999878        39886      8192.00
      11.447     0.999890        39886      9102.22
      11.639     0.999902        39887     10240.00
      11.639     0.999915        39887     11702.86
      12.071     0.999927        39888     13653.33
      12.071     0.999939        39888     16384.00
      12.071     0.999945        39888     18204.44
      22.239     0.999951        39889     20480.00
      22.239     0.999957        39889     23405.71
      22.239     0.999963        39889     27306.67
      22.239     0.999969        39889     32768.00
      22.239     0.999973        39889     36408.89
      24.927     0.999976        39890     40960.00
      24.927     1.000000        39890          inf
#[Mean    =        0.531, StdDeviation   =        0.291]
#[Max     =       24.912, Total count    =        39890]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  59702 requests in 30.00s, 11.33MB read
Requests/sec:   1989.96  
Transfer/sec:    386.72KB