data/raw_bench/200_output.txt
Running 30s test @ http://10.99.59.146:8080/wrk2-api/home-timeline/read
  4 threads and 200 connections

  Thread calibration: mean lat.: 0.747ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.687ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.639ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.696ms, rate sampling interval: 10ms

-----------------------------------------------------------------------
Test Results @ http://10.99.59.146:8080/wrk2-api/home-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   687.39us  115.85us   0.96ms   70.87%
    Req/Sec    53.10     74.71   300.00     91.23%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  683.00us
 75.000%  760.00us
 90.000%  828.00us
 99.000%    0.96ms
 99.900%    1.43ms
 99.990%    1.57ms
 99.999%    1.57ms
100.000%    1.57ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.388     0.000000            1         1.00
       0.543     0.100000          400         1.11
       0.592     0.200000          797         1.25
       0.629     0.300000         1205         1.43
       0.657     0.400000         1598         1.67
       0.683     0.500000         1986         2.00
       0.695     0.550000         2191         2.22
       0.710     0.600000         2391         2.50
       0.725     0.650000         2583         2.86
       0.742     0.700000         2785         3.33
       0.760     0.750000         2987         4.00
       0.769     0.775000         3083         4.44
       0.778     0.800000         3184         5.00
       0.789     0.825000         3281         5.71
       0.801     0.850000         3378         6.67
       0.814     0.875000         3478         8.00
       0.822     0.887500         3532         8.89
       0.828     0.900000         3575        10.00
       0.838     0.912500         3633        11.43
       0.847     0.925000         3679        13.33
       0.856     0.937500         3725        16.00
       0.863     0.943750         3750        17.78
       0.870     0.950000         3776        20.00
       0.879     0.956250         3799        22.86
       0.886     0.962500         3824        26.67
       0.896     0.968750         3848        32.00
       0.901     0.971875         3862        35.56
       0.910     0.975000         3874        40.00
       0.917     0.978125         3888        45.71
       0.926     0.981250         3898        53.33
       0.940     0.984375         3910        64.00
       0.945     0.985938         3918        71.11
       0.951     0.987500         3923        80.00
       0.962     0.989062         3929        91.43
       0.980     0.990625         3935       106.67
       0.990     0.992188         3941       128.00
       0.996     0.992969         3945       142.22
       1.008     0.993750         3948       160.00
       1.025     0.994531         3951       182.86
       1.065     0.995313         3954       213.33
       1.122     0.996094         3957       256.00
       1.132     0.996484         3959       284.44
       1.162     0.996875         3961       320.00
       1.165     0.997266         3962       365.71
       1.229     0.997656         3963       426.67
       1.298     0.998047         3965       512.00
       1.324     0.998242         3966       568.89
       1.324     0.998437         3966       640.00
       1.403     0.998633         3967       731.43
       1.428     0.998828         3968       853.33
       1.496     0.999023         3969      1024.00
       1.496     0.999121         3969      1137.78
       1.496     0.999219         3969      1280.00
       1.503     0.999316         3970      1462.86
       1.503     0.999414         3970      1706.67
       1.530     0.999512         3971      2048.00
       1.530     0.999561         3971      2275.56
       1.530     0.999609         3971      2560.00
       1.530     0.999658         3971      2925.71
       1.530     0.999707         3971      3413.33
       1.571     0.999756         3972      4096.00
       1.571     1.000000         3972          inf
#[Mean    =        0.687, StdDeviation   =        0.116]
#[Max     =        1.571, Total count    =         3972]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  5976 requests in 30.05s, 1.13MB read
  Socket errors: connect 0, read 0, write 0, timeout 1038
Requests/sec:    198.88  
Transfer/sec:     38.65KB